&НаКлиенте
Процедура ИзменениеДатыРождения(Элемент)
	Возраст = ОбщиеФункции.ВычислитьВозраст(Объект.ДатаРождения);
	Если Возраст < 18 Тогда
		Сообщить("Сотрудник не может быть младше 18 лет!"); 
		Объект.ДатаРождения = Объект.СтараяДатаРождения;
	Иначе
		Объект.СтараяДатаРождения = Объект.ДатаРождения;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФИО(Элемент)    
	ПолеФИО = ОбщиеФункции.РазбитьСтрокуНаПодстроки(Объект.ФИО);

	Если ПолеФИО.Количество() > 3 ИЛИ ПолеФИО.Количество() < 2 Тогда
		ОбщиеПроцедуры.НекорректноеФИО(); 
		Объект.ФИО = Объект.СтароеФИО;
	Иначе     
		Имя = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[1]);  
		Фамилия = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[0]);
		Отчество = "-";
		
		Если ПолеФИО.Количество() = 3 Тогда       
			Отчество = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[2]);
		КонецЕсли;
		
		Если ОбщиеФункции.ЭтоКорректноеСлово(Имя) И ОбщиеФункции.ЭтоКорректноеСлово(Фамилия) И ОбщиеФункции.ЭтоКорректноеСлово(Отчество) Тогда
			Объект.Имя = Имя;
			Объект.Фамилия = Фамилия;
			Объект.Отчество = Отчество;             
				
			Объект.ФИО = ОбщиеФункции.СоздатьФИО(Фамилия, Имя, Отчество);
			Объект.Наименование = ОбщиеФункции.СоздатьИнициалы(Фамилия, Имя, Отчество);
			Объект.СтароеФИО = Объект.ФИО;
		Иначе
			ОбщиеПроцедуры.НекорректноеФИО();
			Объект.ФИО = Объект.СтароеФИО;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура Загрузить(Команда)  
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    ДиалогОткрытияФайла.Фильтр = "Изображение (*.png)|*.png";  
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.Картинка = ДиалогОткрытияФайла.ВыбранныеФайлы;
	КонецЕсли;	
КонецПроцедуры
