Функция ВычислитьВозраст(ДатаРождения) Экспорт   
	ТекДата = ТекущаяДата();

	Возврат Год(ТекДата) - Год(ДатаРождения) - ?(Месяц(ТекДата) * 100 + День(ТекДата) < Месяц(ДатаРождения) * 100 + День(ДатаРождения), 1, 0);
КонецФункции    

Функция РазбитьСтрокуНаПодстроки(Строка, Разделитель = " ") Экспорт 
	Возврат СтрРазделить(Строка, Разделитель, Ложь);
КонецФункции       

Функция ЭтоКорректноеСлово(Слово) Экспорт
    Допустимые = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя-";
    Для Инд = 1 По СтрДлина(Слово) Цикл
        Если СтрНайти(Допустимые, Сред(Слово, Инд, 1)) = 0 Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;
КонецФункции 

Функция СловоСЗаглавной(Слово)    Экспорт                
	ФорматированноеСлово  = ВРег(Лев(Слово, 1)); 
	
	Если СтрДлина(Слово) > 1 Тогда 
		ФорматированноеСлово = ФорматированноеСлово + Сред(Слово, 2);  
	КонецЕсли;         
	
	Возврат ФорматированноеСлово;
КонецФункции

Функция СоздатьИнициалы (Фамилия, Имя, Отчество = "-") Экспорт    
	Инициалы = "";
	
	Если Отчество = "-" Тогда
		Инициалы = СтрШаблон("%1 %2.", Фамилия, Сред(Имя, 0, 1));	     
	Иначе
		Инициалы =   СтрШаблон("%1 %2. %3.", Фамилия, Сред(Имя, 0, 1), Сред(Отчество, 0, 1));
	КонецЕсли;                               
	
	Возврат Инициалы;
КонецФункции   

Функция СоздатьФИО(Фамилия, Имя, Отчество = "-") Экспорт         
	ФИО = "";
	
	Если Отчество = "-" Тогда
		ФИО = СтрШаблон("%1 %2", Фамилия, Имя);    
	Иначе
		ФИО = СтрШаблон("%1 %2 %3", Фамилия, Имя, Отчество);
	КонецЕсли;
	
	Возврат ФИО;
КонецФункции      

Функция ЗначениеПеречисленияПоТексту(ИмяПеречисления, Текст) Экспорт
	
	Текст = ВРег(СокрЛП(Текст));
	Если ПустаяСтрока(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеПеречисления = Метаданные.Перечисления.Найти(ИмяПеречисления);
	Если МетаданныеПеречисления = Неопределено Тогда
		ВызватьИсключение "Перечисление """ + ИмяПеречисления + """ не найдено в метаданных";
	КонецЕсли;
	
	Для Каждого ЗначениеДолжности Из МетаданныеПеречисления.ЗначенияПеречисления Цикл
		
		Если ВРег(СокрЛП(ЗначениеДолжности.Имя))     = Текст
			ИЛИ ВРег(СокрЛП(ЗначениеДолжности.Синоним)) = Текст Тогда
			Возврат Перечисления[ИмяПеречисления][ЗначениеДолжности.Имя];
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтрокаВДату(ТекстДата, Дата) Экспорт
	
	МассивДаты = СтрРазделить(ТекстДата, ".");
	Если МассивДаты.Количество() >= 3 Тогда
		Попытка
			ДеньР  = Число(МассивДаты[0]);
			МесяцР = Число(МассивДаты[1]);
			ГодР   = Число(Лев(МассивДаты[2], 4)); 
							
			Дата = Дата(ГодР, МесяцР, ДеньР);   
			
			Возврат Истина;

							
		Исключение      
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции 

//Функция СтрокаВДату(Дата) Экспорт 
//	МассивДаты = СтрРазделить(ТекстДата, ".");
//	
//	ДеньР  = Число(МассивДаты[0]);
//	МесяцР = Число(МассивДаты[1]);
//	ГодР   = Число(Лев(МассивДаты[2], 4)); 
//								
//	Возврат Дата(ГодР, МесяцР, ДеньР);
//КонецФункции 
