
&НаКлиенте
Процедура ЗагрузитьВалюты(Команда)

	ТаблицаКурсовВалют.Очистить();
	
	ЗагрузитьКурсыВалют();

КонецПроцедуры

&НаСервере  
Процедура ЗагрузитьКурсыВалют()

	Определения = Новый WSОпределения("http://www.cbr.ru/DailyInfoWebServ/DailyInfo.asmx?WSDL");
	Прокси = Новый WSПрокси(Определения, "http://web.cbr.ru/", "DailyInfo", "DailyInfoSoap");
	
	ДатаЗагрузки = ТекущаяДата();
	
    ТипWSПараметра = Прокси.ФабрикаXDTO.Пакеты.Получить(
                                        "http://web.cbr.ru/").Получить("GetCursOnDate");
    WSПараметр  = Прокси.ФабрикаXDTO.Создать(ТипWSПараметра);
    WSПараметр.On_Date= ДатаЗагрузки;
    
    КурсыВалют = Прокси.GetCursOnDate(WSПараметр);
    
    Для Каждого Элемент Из КурсыВалют.GetCursOnDateResult.diffgram.ValuteData.ValuteCursOnDate Цикл 
        НоваяСтрокаТЗ = ТаблицаКурсовВалют.Добавить();
        НоваяСтрокаТЗ.НазваниеВалюты      = Элемент.Vname;
        НоваяСтрокаТЗ.Номинал             = Элемент.Vnom;
        НоваяСтрокаТЗ.ЦифровойКодВалюты   = Элемент.Vcode;
        НоваяСтрокаТЗ.СимвольныйКодВалюты = Элемент.VChCode;
        НоваяСтрокаТЗ.КурсВалюты          = Элемент.Vcurs;  
		
		Валюта = Справочники.Валюты.НайтиПоКоду(НоваяСтрокаТЗ.ЦифровойКодВалюты);
		Если Валюта.Пустая() Тогда                             
			
			Валюта = Справочники.Валюты.СоздатьЭлемент();   
			Валюта.Код =  НоваяСтрокаТЗ.ЦифровойКодВалюты; 
		    Валюта.СимвольныйКод = НоваяСтрокаТЗ.СимвольныйКодВалюты;  
			Валюта.Номинал =  НоваяСтрокаТЗ.Номинал; 
			Валюта.Наименование = НоваяСтрокаТЗ.НазваниеВалюты;
			Валюта.Записать();

		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ДатаЗагрузки;
		МенеджерЗаписи.Валюта = Валюта;             
		МенеджерЗаписи.Курс = НоваяСтрокаТЗ.КурсВалюты;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;                             
	
КонецПроцедуры