&НаСервере
Процедура ИмпортироватьИзExcelНаСервере(АдресХранилища, ИсходноеИмяФайла)
    
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
    Расширение = "xlsx";
    Если Найти(НРег(ИсходноеИмяФайла), ".xls") > 0 И Найти(НРег(ИсходноеИмяФайла), ".xlsx") = 0 Тогда
        Расширение = "xls";
    КонецЕсли;
    
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
    ДвоичныеДанные.Записать(ИмяВременногоФайла);
    
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.Прочитать(ИмяВременногоФайла);
    Высота = ТабДок.ВысотаТаблицы;
    
    Для Стр = 2 По Высота Цикл
        
        ИмяОрганизации = СокрЛП(ТабДок.Область(Стр, 1).Текст);
        ИмяАгента      = СокрЛП(ТабДок.Область(Стр, 2).Текст);
        ФИОАгента      = СокрЛП(ТабДок.Область(Стр, 3).Текст);
        
        Если ПустаяСтрока(ИмяОрганизации) Или ПустаяСтрока(ИмяАгента) Тогда
            Продолжить; 
        КонецЕсли;
        
        ОргСсылка = Справочники.Организации.НайтиПоНаименованию(ИмяОрганизации, Истина);
        Если ОргСсылка.Пустая() Тогда
            НовОрг = Справочники.Организации.СоздатьЭлемент();
            НовОрг.Наименование = ИмяОрганизации;
            НовОрг.Записать();
            ОргСсылка = НовОрг.Ссылка;
        КонецЕсли;
        
        АгентСсылка = Справочники.Агенты.НайтиПоНаименованию(ИмяАгента, Истина);
        Если АгентСсылка.Пустая() Тогда
            НовАгент = Справочники.Агенты.СоздатьЭлемент();
        Иначе
            НовАгент = АгентСсылка.ПолучитьОбъект();
        КонецЕсли;
        
        НовАгент.Наименование = ИмяАгента;
        НовАгент.ФИО = ФИОАгента;
        НовАгент.Организация = ОргСсылка;
        
        НовАгент.Записать();
    КонецЦикла;
    
    УдалитьФайлы(ИмяВременногоФайла);
    
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИмпортироватьИзExcel(Команда)
    
    Результат = Ждать ОбщиеАсинхФункции.ВыбратьФайл("Файлы Excel|*.xlsx;*.xls");
	
	Если Результат <> "-" Тогда
	
		ИмпортироватьИзExcelНаСервере(Результат.АдресХранилища, Результат.ПолноеИмяФайла);
    	Сообщить("Агенты успешно загружены!");
		
	КонецЕсли;

КонецПроцедуры