&НаКлиенте
Процедура ВыбратьФайлНаКлиенте(Команда)

    Если Не ЗначениеЗаполнено(Объект.ОбъектЗагрузки) Тогда
        ПоказатьПредупреждение(, "Сначала выберите тип загрузки.");
        Возврат;
    КонецЕсли;

    ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
    ПараметрыДиалога.Заголовок = "Выберите файл для загрузки";
    ПараметрыДиалога.МножественныйВыбор = Ложь;
    ПараметрыДиалога.Фильтр =
        "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls";

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить(
        "ТипЗагрузки", Объект.ОбъектЗагрузки);

    Оповещение = Новый ОписаниеОповещения(
        "ПослеПомещенияФайла",
        ЭтаФорма,
        ДополнительныеПараметры);

    НачатьПомещениеФайлаНаСервер(
        Оповещение,
        ,
        ,
        ,
        ПараметрыДиалога,
        ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры
	
	
&НаКлиенте
Процедура ПослеПомещенияФайла(
    Результат,
    ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Результат.ПомещениеФайлаОтменено Тогда
        Сообщить("Загрузка файла отменена.");
        Возврат;
    КонецЕсли;

    ПрочитатьExcelНаСервере(
        Результат.Адрес,  
        ДополнительныеПараметры.ТипЗагрузки);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьExcelНаСервере(
    АдресВоВременномХранилище,
    ТипЗагрузки)

    ДвоичныеДанные = ПолучитьИзВременногоХранилища(
        АдресВоВременномХранилище);

    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");

    ДвоичныеДанные.Записать(ИмяВременногоФайла);

    Попытка
        ТабДок = Новый ТабличныйДокумент;
        ТабДок.Прочитать(
            ИмяВременногоФайла,
            СпособЧтенияЗначенийТабличногоДокумента.Значение);    
			
			
		Высота  = ТабДок.ВысотаТаблицы;
    	Ширина  = ТабДок.ШиринаТаблицы;		
			
		Если ТипЗагрузки = Перечисления.ТипыЗагрузкиExcel.Организации Тогда  

			Для нСтр = 2 По Высота Цикл
			  
			    Ячейка = ТабДок.Область(нСтр, 1); 
			    
			    Текст = Ячейка.Текст;
			    
			    Если Не ПустаяСтрока(Текст) Тогда
					
					ОбщиеСерверныеПроцедуры.ДобавитьОрганизацию(Текст);
					
				КонецЕсли;
			    
			КонецЦикла;	
			Сообщить("Организации успешно импортированы!"); 
		
		ИначеЕсли ТипЗагрузки = Перечисления.ТипыЗагрузкиExcel.Агенты Тогда   
			
			Для нСтр = 2 По Высота Цикл
        
		        Организация = ТабДок.Область(нСтр, 1).Текст;
		        Имя         = ТабДок.Область(нСтр, 2).Текст;
		        ФИО         = ТабДок.Область(нСтр, 3).Текст;
	       	        
	    	КонецЦикла;  
		
		Иначе     
			Сообщить("Неопознанный тип!");
		КонецЕсли;
		
			
		
    Исключение
        УдалитьФайлы(ИмяВременногоФайла);
        УдалитьИзВременногоХранилища(
            АдресВоВременномХранилище);
        ВызватьИсключение;
    КонецПопытки;

    УдалитьФайлы(ИмяВременногоФайла);
    УдалитьИзВременногоХранилища(
        АдресВоВременномХранилище);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрганизации(МассивИзОрганизаций)

КонецПроцедуры;