&НаКлиенте
Процедура ВыбратьФайлНаКлиенте(Команда)

    Если Не ЗначениеЗаполнено(Объект.ОбъектЗагрузки) Тогда
        ПоказатьПредупреждение(, "Сначала выберите тип загрузки.");
        Возврат;
    КонецЕсли;

    ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
    ПараметрыДиалога.Заголовок = "Выберите файл для загрузки";
    ПараметрыДиалога.МножественныйВыбор = Ложь;
    ПараметрыДиалога.Фильтр =
        "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls";

    ДополнительныеПараметры = Новый Структура;
    ДополнительныеПараметры.Вставить(
        "ТипЗагрузки", Объект.ОбъектЗагрузки);

    Оповещение = Новый ОписаниеОповещения(
        "ПослеПомещенияФайла",
        ЭтаФорма,
        ДополнительныеПараметры);

    НачатьПомещениеФайлаНаСервер(
        Оповещение,
        ,
        ,
        ,
        ПараметрыДиалога,
        ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры
	
	
&НаКлиенте
Процедура ПослеПомещенияФайла(
    Результат,
    ДополнительныеПараметры) Экспорт

    Если Результат = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если Результат.ПомещениеФайлаОтменено Тогда
        Сообщить("Загрузка файла отменена.");
        Возврат;
    КонецЕсли;

    ПрочитатьExcelНаСервере(
        Результат.Адрес,  
        ДополнительныеПараметры.ТипЗагрузки);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьExcelНаСервере(
    АдресВоВременномХранилище,
    ТипЗагрузки)

    ДвоичныеДанные = ПолучитьИзВременногоХранилища(
        АдресВоВременномХранилище);

    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");

    ДвоичныеДанные.Записать(ИмяВременногоФайла);

    Попытка
        ТабДок = Новый ТабличныйДокумент;
        ТабДок.Прочитать(
            ИмяВременногоФайла,
            СпособЧтенияЗначенийТабличногоДокумента.Значение);    
			
		МассивСтрок = Новый Массив();
		Если ТипЗагрузки = Перечисления.ТипыЗагрузкиExcel.Организации Тогда 
			
			Высота = ТабДок.ВысотаТаблицы; 

			Для нСтр = 1 По Высота Цикл
			  
			    Ячейка = ТабДок.Область(нСтр, 1); 
			    
			    Текст = Ячейка.Текст;
			    
			    Если Не ПустаяСтрока(Текст) Тогда
					
					Если Справочники.Организации.НайтиПоНаименованию(Текст).Пустая() Тогда
						
						НоваяОрганизация = Справочники.Организации.СоздатьЭлемент();   
						НоваяОрганизация.Наименование = Текст;
						НоваяОрганизация.Записать();
						
					КонецЕсли;
					
				КонецЕсли;
			    
			КонецЦикла;	
			Сообщить("Организации успешно импортированы!");
			
		КонецЕсли;
		
    Исключение
        УдалитьФайлы(ИмяВременногоФайла);
        УдалитьИзВременногоХранилища(
            АдресВоВременномХранилище);
        ВызватьИсключение;
    КонецПопытки;

    УдалитьФайлы(ИмяВременногоФайла);
    УдалитьИзВременногоХранилища(
        АдресВоВременномХранилище);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрганизации(МассивИзОрганизаций)

КонецПроцедуры;