&НаСервере
Процедура ИмпортироватьИзExcelНаСервере(АдресХранилища, ИсходноеИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		ТабДок.Прочитать(ИмяВременногоФайла);
	Исключение
		Сообщить("Ошибка чтения файла Excel!");
		УдалитьФайлы(ИмяВременногоФайла);
		Возврат;
	КонецПопытки;
	
	Высота = ТабДок.ВысотаТаблицы;
	
	Для Стр = 2 По Высота Цикл

		Должность   = ОбщиеСерверныеФункции.ЗначениеПеречисленияПоТексту("Должности", СокрЛП(ТабДок.Область(Стр, 2).Текст));
		МассивФИО       = ОбщиеСерверныеФункции.РазбитьСтрокуНаПодстроки(СокрЛП(ТабДок.Область(Стр, 4).Текст));         
		ТекстДата        = СокрЛП(ТабДок.Область(Стр, 5).Текст); 
		
		Если (МассивФИО.Количество() = 3 ИЛИ МассивФИО.Количество() = 2) И Должность <> Неопределено Тогда       
			
			Если МассивФИО.Количество() = 2 Тогда
				МассивФИО.Добавить("-");
			КонецЕсли;   
			
			Если ОбщиеСерверныеФункции.ЭтоКорректноеСлово(МассивФИО[0]) И ОбщиеСерверныеФункции.ЭтоКорректноеСлово(МассивФИО[1]) И ОбщиеСерверныеФункции.ЭтоКорректноеСлово(МассивФИО[2]) Тогда
				
				Наименование = ОбщиеСерверныеФункции.СоздатьИнициалы(
					МассивФИО[0], 
					МассивФИО[1],
					МассивФИО[2]
				);
				СотрудникСсылка = Справочники.Сотрудники.НайтиПоНаименованию(Наименование); 
				
				Если СотрудникСсылка.Пустая() Тогда
					НовСотр = Справочники.Сотрудники.СоздатьЭлемент();
					НовСотр.Наименование = Наименование; 
					НовСотр.Должность = Должность;
					
					НовСотр.ФИО = ОбщиеСерверныеФункции.СоздатьФИО(МассивФИО[1], МассивФИО[0], МассивФИО[2]);      			
					МассивДаты = СтрРазделить(ТекстДата, ".");
					Если МассивДаты.Количество() >= 3 Тогда
						Попытка
							ДеньР  = Число(МассивДаты[0]);
							МесяцР = Число(МассивДаты[1]);
							ГодР   = Число(Лев(МассивДаты[2], 4)); 
							
							НовСотр.ДатаРождения = Дата(ГодР, МесяцР, ДеньР);  
							
							НовСотр.Записать();
						Исключение
						КонецПопытки;
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЕсли
		
		КонецЕсли;
	
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИмпортироватьИзExcel(Команда)
	Результат = Ждать ОбщиеАсинхФункции.ВыбратьФайл("Файлы Excel|*.xlsx;*.xls");
	
	Если Результат <> "-" Тогда
	
		ИмпортироватьИзExcelНаСервере(Результат.АдресХранилища, Результат.ПолноеИмяФайла);
    	Сообщить("Сотрудники успешно загружены!");
		
	КонецЕсли;

КонецПроцедуры
