Функция ВычислитьВозраст(ДатаРождения) Экспорт   
	ТекДата = ТекущаяДата();

	Возврат Год(ТекДата) - Год(ДатаРождения) - ?(Месяц(ТекДата) * 100 + День(ТекДата) < Месяц(ДатаРождения) * 100 + День(ДатаРождения), 1, 0);
КонецФункции    

Функция РазбитьСтрокуНаПодстроки(Строка, Разделитель = " ") Экспорт 
	Возврат СтрРазделить(Строка, Разделитель, Ложь);
КонецФункции       

Функция ЭтоКорректноеСлово(Слово) Экспорт
    Допустимые = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя-";
    Для Инд = 1 По СтрДлина(Слово) Цикл
        Если СтрНайти(Допустимые, Сред(Слово, Инд, 1)) = 0 Тогда
            Возврат Ложь;
        КонецЕсли;
    КонецЦикла;
    Возврат Истина;
КонецФункции 

Функция СловоСЗаглавной(Слово)    Экспорт                
	ФорматированноеСлово  = ВРег(Лев(Слово, 1)); 
	
	Если СтрДлина(Слово) > 1 Тогда 
		ФорматированноеСлово = ФорматированноеСлово + Сред(Слово, 2);  
	КонецЕсли;         
	
	Возврат ФорматированноеСлово;
КонецФункции

Функция СоздатьИнициалы (Фамилия, Имя, Отчество = "-") Экспорт    
	Инициалы = "";
	
	Если Отчество = "-" Тогда
		Инициалы = СтрШаблон("%1 %2.", Фамилия, Сред(Имя, 0, 1));	     
	Иначе
		Инициалы =   СтрШаблон("%1 %2. %3.", Фамилия, Сред(Имя, 0, 1), Сред(Отчество, 0, 1));
	КонецЕсли;                               
	
	Возврат Инициалы;
КонецФункции   

Функция СоздатьФИО(Фамилия, Имя, Отчество = "-") Экспорт         
	ФИО = "";
	
	Если Отчество = "-" Тогда
		ФИО = СтрШаблон("%1 %2", Фамилия, Имя);    
	Иначе
		ФИО = СтрШаблон("%1 %2 %3", Фамилия, Имя, Отчество);
	КонецЕсли;
	
	Возврат ФИО;
КонецФункции      