
&НаСервере
Процедура ИмпортироватьИзExcelНаСервере(АдресВХранилище, ИсходноеИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	    
	Расширение = "xlsx";
	Если Найти(НРег(ИсходноеИмяФайла), ".xls") > 0 И Найти(НРег(ИсходноеИмяФайла), ".xlsx") = 0 Тогда
		Расширение = "xls";
	КонецЕсли;
	            
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяВременногоФайла);
	
	Высота = ТабДок.ВысотаТаблицы;
	
	Для Стр = 2 По Высота Цикл
        ФИО = СокрЛП(ТабДок.Область(Стр, 1).Текст);
        Если ПустаяСтрока(ФИО) Тогда
            Продолжить; 
        КонецЕсли;
        
        МассивСловФИО = СтрРазделить(ФИО, " ");
        Фамилия = ?(МассивСловФИО.Количество() > 0, МассивСловФИО[0], ФИО);    
		
		Серия = СокрЛП(ТабДок.Область(Стр, 5).Текст);
        Номер = СокрЛП(ТабДок.Область(Стр, 6).Текст); 
		СерияНомер = Серия + Номер;
		
		ПаспортСсылка = Справочники.ПаспортныеДанные.НайтиПоНаименованию(СерияНомер);
		Если ПаспортСсылка.Пустая() И СтрДлина(Серия) = 4 И СтрДлина(Номер) = 6 Тогда              
			
			ПаспортСсылка = Справочники.ПаспортныеДанные.СоздатьЭлемент();
			
			ДатаВыдачи = Дата(1, 1, 1);
            ДатаОкончания = Дата(1, 1, 1);
			
			Если ОбщиеСерверныеФункции.СтрокаВДату(ТабДок.Область(Стр, 7).Текст, ДатаВыдачи) И ОбщиеСерверныеФункции.СтрокаВДату(ТабДок.Область(Стр, 8).Текст, ДатаОкончания) Тогда
				
				ПаспортСсылка.Наименование = СерияНомер;
				ПаспортСсылка.ДатаВыдачи = ДатаВыдачи;
				ПаспортСсылка.ДатаОкончанияДействия = ДатаОкончания; 
				
				ОрганНаименование = СокрЛП(ТабДок.Область(Стр, 9).Текст);
	            Если Не ПустаяСтрока(ОрганНаименование) Тогда
					
					ОрганСсылка = Справочники.ОрганыВыдачиДокументов.НайтиПоНаименованию(ОрганНаименование);
	                Если ОрганСсылка.Пустая() Тогда
						
						ОрганСсылка = Справочники.ОрганыВыдачиДокументов.СоздатьЭлемент();
	                    ОрганСсылка.Наименование = ОрганНаименование;
	                    ОрганСсылка.Записать();
						
					КонецЕсли; 
					
	            КонецЕсли;
				
				ПаспортСсылка.ОрганВыдавшийДокумент = ОрганСсылка;  
				ПаспортСсылка.Записать();
				
				
            КонецЕсли;
            			
		КонецЕсли;   
		
		Если ПаспортСсылка.Пустая() = Ложь Тогда  
			
			Если Справочники.Клиенты.НайтиПоРеквизиту("ПаспортныеДанные", ПаспортСсылка).Пустая() Тогда      
				
				НовКлиент = Справочники.Клиенты.СоздатьЭлемент();
				НовКлиент.ПаспортныеДанные = ПаспортСсылка;
				
				
				
			КонецЕсли;
				
		КонецЕсли;
		
		//Если ПаспортСсылка.Пустая() = Ложь Тогда 
		//	КлиентСсылка = Справочники.Клиенты.НайтиПоНаименованию(Фамилия);
		//Если КлиентСсылка.Пустая() Тогда
		//    НовКлиент = Справочники.Клиенты.СоздатьЭлемент();
		//Иначе
		//    НовКлиент = КлиентСсылка.ПолучитьОбъект();
		//КонецЕсли;
		//
		//НовКлиент.Наименование = Фамилия;
		//НовКлиент.ФИО = ФИО;
		//
		//ПолСимвол = СокрЛП(ТабДок.Область(Стр, 2).Текст);
		//Если ПолСимвол = "М" Тогда
		//    НовКлиент.Пол = Перечисления.Пол.Мужской;
		//ИначеЕсли ПолСимвол = "Ж" Тогда
		//    НовКлиент.Пол = Перечисления.Пол.Женский;
		//КонецЕсли;

		//ДатаРождения = Дата(1, 1, 1);
		//Если ОбщиеСерверныеФункции.СтрокаВДату(ТабДок.Область(Стр, 3).Текст, ДатаРождения) Тогда
		//    НовКлиент.ДатаРождения = ДатаРождения;
		//КонецЕсли;             

		//Если НовКлиент.СтатусКлиента.Пустая() Тогда
		//    НовКлиент.СтатусКлиента = Перечисления.СтатусКлиента.Обычный;
		//КонецЕсли;

		//НовКлиент.Записать(); 
		//КонецЕсли; 
                                
    КонецЦикла;			
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИмпортироватьИзExcel(Команда)
	
    Результат = Ждать ОбщиеАсинхФункции.ВыбратьФайл("Файлы Excel|*.xlsx;*.xls");
	
	Если Результат <> "-" Тогда
	
		ИмпортироватьИзExcelНаСервере(Результат.АдресХранилища, Результат.ПолноеИмяФайла);
    	Сообщить("Клиенты успешно загружены!");
		
	КонецЕсли;
	
КонецПроцедуры
