&НаКлиенте
Асинх функция ВыбратьФайл(Фильтр) Экспорт
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.МножественныйВыбор = Ложь;
    Диалог.Фильтр = Фильтр;
    
    РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
    
    Если РезультатВыбора = Неопределено Тогда
        Возврат "-";
    КонецЕсли;
    
    ПолноеИмяФайла = Диалог.ПолноеИмяФайла;
    
    ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПолноеИмяФайла);
    
    АдресХранилища = ОписаниеФайла.Адрес;
	
	Возврат Новый Структура("ПолноеИмяФайла, АдресХранилища", ПолноеИмяФайла, АдресХранилища);

КонецФункции