&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПолеФИО = ОбщиеФункции.РазбитьСтрокуНаПодстроки(Объект.ФИО);

	Если ПолеФИО.Количество() > 3 ИЛИ ПолеФИО.Количество() < 2 Тогда
		ОбщиеПроцедуры.НекорректноеФИО(); 
	Иначе     
		Имя = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[1]);  
		Фамилия = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[0]);
		Отчество = "-";
		
		Если ПолеФИО.Количество() = 3 Тогда       
			Отчество = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[2]);
		КонецЕсли;
		
		Если ОбщиеФункции.ЭтоКорректноеСлово(Имя) И ОбщиеФункции.ЭтоКорректноеСлово(Фамилия) И ОбщиеФункции.ЭтоКорректноеСлово(Отчество) Тогда
			Объект.ФИО = ОбщиеФункции.СоздатьФИО(Фамилия, Имя, Отчество);
			Объект.Наименование = ОбщиеФункции.СоздатьИнициалы(Фамилия, Имя,Отчество);
		Иначе
			ОбщиеПроцедуры.НекорректноеФИО(); 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
