&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(ТекущийОбъект.Агент) И ТекущийОбъект.Агент.Организация <>   ТекущийОбъект.Организация Тогда
		Отказ = ИСТИНА;  
		Сообщить("Агент не работает в данной организации!");
		Возврат;
	КонецЕсли;  
	
	Для Каждого СтрокаТЧ Из ТекущийОбъект.ГородаПосещения Цикл
	    Если СтрокаТЧ.Город.Страна <> ТекущийОбъект.Страна Тогда
	        Сообщить(СтрШаблон("Города '%1' нет в стране '%2'", СтрокаТЧ.Город, ТекущийОбъект.Страна));
	        Отказ = ИСТИНА;
	        Возврат;
	    КонецЕсли;
	КонецЦикла;	
КонецПроцедуры
