
&НаСервере
Процедура ИмпортироватьИзExcelНаСервере(АдресВХранилище, ИсходноеИмяФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХранилище);
	Расширение = "xlsx";
	Если Найти(НРег(ИсходноеИмяФайла), ".xls") > 0 И Найти(НРег(ИсходноеИмяФайла), ".xlsx") = 0 Тогда
		Расширение = "xls";
	КонецЕсли;
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяВременногоФайла);
	Высота = ТабДок.ВысотаТаблицы;
	
	Для Стр = 2 По Высота Цикл
		
		ИмяСтраны = СокрЛП(ТабДок.Область(Стр, 1).Текст);
		ИмяГорода = СокрЛП(ТабДок.Область(Стр, 2).Текст);
		ИмяОтеля  = СокрЛП(ТабДок.Область(Стр, 3).Текст);
		Категория = СокрЛП(ТабДок.Область(Стр, 4).Текст);
		Адрес     = СокрЛП(ТабДок.Область(Стр, 5).Текст);
		
		Если ПустаяСтрока(ИмяСтраны) Или ПустаяСтрока(ИмяГорода) Или ПустаяСтрока(ИмяОтеля) Тогда
			Продолжить; 
		КонецЕсли;
		
		СтранаСсылка = Справочники.Страны.НайтиПоНаименованию(ИмяСтраны, Истина);
		Если СтранаСсылка.Пустая() Тогда
			НовСтрана = Справочники.Страны.СоздатьЭлемент();
			НовСтрана.Наименование = ИмяСтраны;
			НовСтрана.Записать();
			СтранаСсылка = НовСтрана.Ссылка;
		КонецЕсли;
		
		ГородСсылка = Справочники.Города.НайтиПоНаименованию(ИмяГорода, Истина, СтранаСсылка);
		Если ГородСсылка.Пустая() Тогда
			НовГород = Справочники.Города.СоздатьЭлемент();
			НовГород.Наименование = ИмяГорода;
			НовГород.Страна = СтранаСсылка; 
			НовГород.Записать();
			ГородСсылка = НовГород.Ссылка;
		КонецЕсли;
		
		ОтельСсылка = Справочники.Отели.НайтиПоНаименованию(ИмяОтеля, Истина, ГородСсылка);
		Если ОтельСсылка.Пустая() Тогда
			НовОтель = Справочники.Отели.СоздатьЭлемент();  
			НовОтель.Страна = СтранаСсылка;
			НовОтель.Город = ГородСсылка; 
		Иначе
			НовОтель = ОтельСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		НовОтель.Наименование = ИмяОтеля;
		НовОтель.Адрес = Адрес;
		
		Если Категория = "1" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.ОднаЗвезда;
		ИначеЕсли Категория = "2" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.ДвеЗвезды;
		ИначеЕсли Категория = "3" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.ТриЗвезды;
		ИначеЕсли Категория = "4" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.ЧетыреЗвезды;
		ИначеЕсли Категория = "5" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.ПятьЗвезд;
		ИначеЕсли НРег(Категория) = "апартаменты" Тогда
			НовОтель.Тип = Перечисления.ТипОтеля.Апартаменты;
		КонецЕсли;
		
		НовОтель.Записать();	
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИмпортироватьИзExcel(Команда)

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Файлы Excel|*.xlsx;*.xls";
    
    РезультатВыбора = Ждать Диалог.ВыбратьАсинх();
    
    Если РезультатВыбора = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ПолноеИмяФайла = Диалог.ПолноеИмяФайла;
    
    ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПолноеИмяФайла);
    
    АдресХранилища = ОписаниеФайла.Адрес;
	
	ИмпортироватьИзExcelНаСервере(АдресХранилища, ПолноеИмяФайла);
    
    Сообщить("Отели успешно загружены!");


КонецПроцедуры
