&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ПаспортныеДанные) Тогда
        
        ЗначениеВРеквизитФормы(
            Объект.ПаспортныеДанные.ПолучитьОбъект(),
            "ПаспортныеДанные"
        );
        
    Иначе
        
        ЗначениеВРеквизитФормы(
            Справочники.ПаспортныеДанные.СоздатьЭлемент(),
            "ПаспортныеДанные"
        );
        
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    			
	
	ПаспортныеДанныеОбъект = РеквизитФормыВЗначение("ПаспортныеДанные");      
	
	Если ПаспортныеДанныеОбъект.ДатаВыдачи >= ПаспортныеДанныеОбъект.ДатаОкончанияДействия Тогда
		Сообщить("Дата выдачи быть раньше, чем окончания!");   
		Отказ = ИСТИНА; 
		Возврат;
	КонецЕсли;                          
		
    ПаспортныеДанныеОбъект.Записать();

    ТекущийОбъект.ПаспортныеДанные =
        ПаспортныеДанныеОбъект.Ссылка;  
		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПолеФИО = ОбщиеФункции.РазбитьСтрокуНаПодстроки(Объект.ФИО);
	Если ПолеФИО.Количество() > 3 ИЛИ ПолеФИО.Количество() < 2 Тогда 
		
		Сообщить("Некорректной ФИО!");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;       
  
	Фамилия = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[0]); 
	Имя = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[1]);
	Если ПолеФИО.Количество() = 2 Тогда
		
		ФИО = Фамилия + Имя; 
		
	Иначе                     
		
		Отчество = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[2]);
		Объект.ФИО = Фамилия + Имя + Отчество;
		
	КонецЕсли; 
	
	Объект.Наименование = Фамилия; 

	
КонецПроцедуры


