&НаКлиенте
Процедура ИзменениеДатыРождения(Элемент)
	Возраст = ОбщиеФункции.ВычислитьВозраст(Объект.ДатаРождения);
	Если Возраст < 18 Тогда
		Сообщить("Клиент должен быть совершеннолетним!"); 
		Объект.ДатаРождения = Объект.СтараяДатаРождения;
	Иначе
		Объект.СтараяДатаРождения = Объект.ДатаРождения;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИзменениеФИО(Элемент)
	ПолеФИО = ОбщиеФункции.РазбитьСтрокуНаПодстроки(Объект.ФИО);

	Если ПолеФИО.Количество() > 3 ИЛИ ПолеФИО.Количество() < 2 Тогда
		ОбщиеПроцедуры.НекорректноеФИО(); 
		Объект.ФИО = Объект.СтароеФИО;
	Иначе     
		Имя = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[1]);  
		Фамилия = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[0]);
		Отчество = "-";
		
		Если ПолеФИО.Количество() = 3 Тогда       
			Отчество = ОбщиеФункции.СловоСЗаглавной(ПолеФИО[2]);
		КонецЕсли;
		
		Если ОбщиеФункции.ЭтоКорректноеСлово(Имя) И ОбщиеФункции.ЭтоКорректноеСлово(Фамилия) И ОбщиеФункции.ЭтоКорректноеСлово(Отчество) Тогда
			Объект.Имя = Имя;
			Объект.Фамилия = Фамилия;
			Объект.Отчество = Отчество;             
				
			Объект.ФИО = ОбщиеФункции.СоздатьФИО(Фамилия, Имя, Отчество);
			Объект.Наименование = Фамилия;
			Объект.СтароеФИО = Объект.ФИО;
		Иначе
			ОбщиеПроцедуры.НекорректноеФИО(); 
			Объект.ФИО = Объект.СтароеФИО;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ПаспортныеДанные) Тогда
        
        ЗначениеВРеквизитФормы(
            Объект.ПаспортныеДанные.ПолучитьОбъект(),
            "ПаспортныеДанные"
        );
        
    Иначе
        
        ЗначениеВРеквизитФормы(
            Справочники.ПаспортныеДанные.СоздатьЭлемент(),
            "ПаспортныеДанные"
        );
        
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)    

	ПаспортныеДанныеОбъект = РеквизитФормыВЗначение("ПаспортныеДанные");      
	
	Если ПаспортныеДанныеОбъект.ДатаВыдачи >= ПаспортныеДанныеОбъект.ДатаОкончанияДействия Тогда
		Сообщить("Дата выдачи быть раньше, чем окончания!");   
		Отказ = ИСТИНА; 
		Возврат;
	КонецЕсли;                          
		
    ПаспортныеДанныеОбъект.Записать();

    ТекущийОбъект.ПаспортныеДанные =
        ПаспортныеДанныеОбъект.Ссылка;  
		
КонецПроцедуры


