&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого ЭлементКоллекции Из Объект.УчастникиПоездки Цикл
		
		ПолеФИО = ОбщиеФункции.РазбитьСтрокуНаПодстроки(ЭлементКоллекции.ФИО);

		Если ПолеФИО.Количество() > 3 ИЛИ ПолеФИО.Количество() < 2 Тогда
			ОбщиеПроцедуры.НекорректноеФИО("Неполное ФИО!");
			Отказ = ИСТИНА;  
		КонецЕсли;
			
		Фамилия = ПолеФИО[0];
		Имя = ПолеФИО[1];
		Отчество = "-";
		
		Если ПолеФИО.Количество() = 3 Тогда
			Отчество = ПолеФИО[2];
		КонецЕсли;
		
		Если ОбщиеФункции.ЭтоКорректноеСлово(Имя) = Ложь ИЛИ ОбщиеФункции.ЭтоКорректноеСлово(Фамилия) = Ложь ИЛИ ОбщиеФункции.ЭтоКорректноеСлово(Отчество) = Ложь Тогда
			ОбщиеПроцедуры.НекорректноеФИО("В ФИО должна быть одна кириллица!");
			Отказ = ИСТИНА;
		КонецЕсли;     
		
	КонецЦикла;   
	
	Если Объект.НачалоПоездки >= Объект.ОкончаниеПоездки Тогда
		Сообщить("Начало поездки должно быть раньше конца поездки!");  
		Отказ = ИСТИНА;
	КонецЕсли; 
	
	Для Каждого ЭлементКоллекции Из Объект.МаршрутПоездки Цикл
		
		Если ЭлементКоллекции.ДатаНачала >= ЭлементКоллекции.ДатаОкончания Тогда
			Сообщить("Дата начала точки маршрута должна быть строго раньше даты окончания!");
			Отказ = ИСТИНА;
		КонецЕсли;
		
		Если ЭлементКоллекции.ДатаНачала < Объект.НачалоПоездки Тогда      
			Сообщить("Некорректная дата начала поездки или дата начала точки маршрута!");
			Отказ = ИСТИНА;
		КонецЕсли; 
		
		Если ЭлементКоллекции.ДатаОкончания > Объект.ОкончаниеПоездки Тогда      
			Сообщить("Некорректная дата окончания поездки или дата окончания точки маршрута!");
			Отказ = ИСТИНА;
		КонецЕсли;

	КонецЦикла;   
	 
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииГородаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииГорода(Элемент)
	ПриИзмененииГородаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораСоглашения(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
        Возврат;
    КонецЕсли;
    
    ДанныеСоглашения = ПолучитьДанныеСоглашенияНаСервере(ВыбранноеЗначение);  
    Объект.Клиент = ДанныеСоглашения.Клиент;    
    Объект.СтранаПосещения = ДанныеСоглашения.Страна;
	Объект.Организация = ДанныеСоглашения.Организация;
	Объект.Агент = ДанныеСоглашения.Агент;
	
	Пока Объект.УчастникиПоездки.Количество() < ДанныеСоглашения.ЧислоУчастниковПоездки Цикл 
		Объект.УчастникиПоездки.Добавить();
	КонецЦикла;
	
	Пока Объект.УчастникиПоездки.Количество() > ДанныеСоглашения.ЧислоУчастниковПоездки Цикл
		Объект.УчастникиПоездки.Удалить(Объект.УчастникиПоездки.Количество() - 1);
	КонецЦикла;    
	
	Объект.МаршрутПоездки.Очистить();
	
	Для Счетчик = 0 По ДанныеСоглашения.ГородаПосещения.Количество() - 1 Цикл	
		Объект.МаршрутПоездки.Добавить();
		Объект.МаршрутПоездки[Счетчик].Город = ДанныеСоглашения.ГородаПосещения[Счетчик].Город;
	КонецЦикла; 	
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьДанныеСоглашенияНаСервере(Ссылка)
    
    Результат = Новый Структура("Клиент, Страна, Организация, Агент, ГородаПосещения, ЧислоУчастниковПоездки");
    
    Если ЗначениеЗаполнено(Ссылка) Тогда
		
		 Результат.Клиент = Ссылка.Клиент;
		 Результат.Страна = Ссылка.Страна;
		 Результат.Организация = Ссылка.Организация;
		 Результат.Агент = Ссылка.Агент;		 
		 Результат.ЧислоУчастниковПоездки = Ссылка.ЧислоУчастниковПоездки;
		 
		 Результат.ГородаПосещения = Новый Массив();
		 
		 Для Каждого СтрокаТЧ Из Ссылка.ГородаПосещения Цикл
            Результат.ГородаПосещения.Добавить(Новый Структура("Город", СтрокаТЧ.Город));
         КонецЦикла;
		
	КонецЕсли;
		    
    Возврат Результат;
    
КонецФункции  
